src/app/controllers/listings_controller.rb

INSERT INTO "listings" ("title", "condition", "price", "description", "user_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def show
    session = Stripe::Checkout::Session.create(
      payment_method_types: ['card'],
      customer_email:current_user && current_user.email,
      line_items: [
        {
          name: @listing.title,
          description: @listing.description,
          amount: @listing.price,
          currency: 'aud',
          quantity: 1
        }
      ],
      # creating a checkout session and payment intent
      payment_intent_data: {
        metadata: {
          user_id: current_user && current_user.id,
          listing_id: @listing.id
        }
      },
      success_url: "#{root_url}payments/success/#{@listing.id}",
      cancel_url: root_url
    )

INSERT INTO "listings" ("title", "condition", "price", "description", "user_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @listing = current_user.listings.new(listing_params) #This method interacts with DB to create a new entry of listing
    if @listing.save

UPDATE "listings" SET "price" = $1, "updated_at" = $2 WHERE "listings"."id" = $3  [["price", 1000], ["updated_at", "2022-04-05 05:57:25.224072"], ["id", 3]]
---
  def update

    @listing.update(listing_params)

SELECT "categories".* FROM "categories"
---
  def set_form_vars
    @categories = Category.all