src/app/controllers/payments_controller.rb

SELECT "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def success
        @listing = Listing.find(params[:id])

SELECT "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "listings" SET "sold" = $1, "updated_at" = $2 WHERE "listings"."id" = $3  [["sold", true], ["updated_at", "2022-04-06 11:27:35.419158"], ["id", 10]]
---
    def webhook
        payment_intent_id = params[:data][:object][:payment_intent]
        payment = Stripe::PaymentIntent.retrieve(payment_intent_id)
        listing_id = payment.metadata.listing_id
        pp payment.charges.data[0].receipt_url
        @listing = Listing.find(listing_id)
        @listing.update(sold: true)