app/controllers/listings_controller.rb

  def create
    @listing = current_user.listings.new(listing_params)
    if @listing.save
---
INSERT INTO "listings" ("title", "condition", "price", "description", "user_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update

    @listing.update(listing_params)
---
UPDATE "listings" SET "category_id" = $1, "updated_at" = $2 WHERE "listings"."id" = $3  [["category_id", 3], ["updated_at", "2022-03-17 16:35:37.936601"], ["id", 8]]

  def set_form_vars
    @categories = Category.all
---
SELECT "categories".* FROM "categories"